DataProcessors/Дашборд.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>Дашборд</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиаграммаКатегории</Name>
					<Type>
						<v8:Type>d7p1:Chart</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДиаграммаПользователи</Name>
					<Type>
						<v8:Type>d7p1:Chart</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокРасходов</Name>
					<Type>
						<v8:Type>v8:ValueTable</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

AccumulationRegisters/ОборотыПоКатегориям.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОборотыПоКатегориям</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КатегорииРасходов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ОстаткиДенег.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиДенег</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

DataProcessors/Дашборд/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Процедура Обновить(Коменда)
	   ОбновитьДанныеНаСервере();
   КонецПроцедуры   
   
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// 1. Устанавливаем тип "Пирог"
    Объект.ДиаграммаКатегории.ТипДиаграммы = ТипДиаграммы.Гистограмма;
    Сортировка = Перечисления.ТипыДанныхГрафикаДашборта.КатегорияПапка;    
    // Настройки для гистограммы (чтобы столбики тоже могли быть разными)
    Объект.ДиаграммаПользователи.ТипДиаграммы = ТипДиаграммы.Гистограмма;
    // Устанавливаем даты и обновляем
    ТекущаяДата = ТекущаяДата();
	Объект.ДатаНачала   = НачалоМесяца(ТекущаяДата);
	Объект.ДатаОкончания = КонецДня(ТекущаяДата);
	
	ОбновитьДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеНаСервере()
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаНачала) Тогда
		Объект.ДатаНачала = НачалоДня(ТекущаяДата());
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.ДатаОкончания) Тогда
		Объект.ДатаОкончания = КонецДня(ТекущаяДата());
	КонецЕсли;
	
	// Режим группировки для графика категорий
	Если Сортировка = Перечисления.ТипыДанныхГрафикаДашборта.КатегорияПапка Тогда
		ВыражениеКатегорииГрафика =
		"ВЫБОР
		|	КОГДА Обороты.Категория.ЭтоГруппа ТОГДА Обороты.Категория
		|	ИНАЧЕ Обороты.Категория.Родитель
		|КОНЕЦ";
	Иначе
		// КатегорияРеквизит
		ВыражениеКатегорииГрафика = "Обороты.Категория";
	КонецЕсли;
	
	// 1. Очистка диаграмм
	Объект.ДиаграммаКатегории.Очистить();
	Объект.ДиаграммаКатегории.ТипДиаграммы = ТипДиаграммы.Гистограмма;
	Объект.ДиаграммаПользователи.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 5
	|	Траты.Период КАК Дата,
	|	Траты.Категория КАК Категория,
	|	Траты.Сумма КАК Сумма,
	|	Траты.Пользователь КАК Пользователь
	|ИЗ
	|	РегистрНакопления.ОборотыПоКатегориям КАК Траты
	|ГДЕ
	|	Траты.Период МЕЖДУ &Начало И &Конец
	|УПОРЯДОЧИТЬ ПО
	|	Дата УБЫВ;
	|
	|ВЫБРАТЬ
	|	" + ВыражениеКатегорииГрафика + " КАК КатегорияГрафика,
	|	СУММА(Обороты.СуммаОборот) КАК Сумма
	|ИЗ
	|	РегистрНакопления.ОборотыПоКатегориям.Обороты(&Начало, &Конец) КАК Обороты
	|СГРУППИРОВАТЬ ПО
	|	" + ВыражениеКатегорииГрафика + ";
	|
	|ВЫБРАТЬ
	|	Обороты.Пользователь КАК Пользователь,
	|	СУММА(Обороты.СуммаОборот) КАК Сумма
	|ИЗ
	|	РегистрНакопления.ОборотыПоКатегориям.Обороты(&Начало, &Конец) КАК Обороты
	|СГРУППИРОВАТЬ ПО
	|	Обороты.Пользователь;
	|
	|ВЫБРАТЬ
	|	Деньги.Пользователь КАК Пользователь,
	|	СУММА(Деньги.СуммаОстаток) КАК Остаток
	|ИЗ
	|	РегистрНакопления.ОстаткиДенег.Остатки КАК Деньги
	|СГРУППИРОВАТЬ ПО
	|	Деньги.Пользователь";
	
	Запрос.УстановитьПараметр("Начало", НачалоДня(Объект.ДатаНачала));
	Запрос.УстановитьПараметр("Конец", КонецДня(Объект.ДатаОкончания));
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	// 1) Последние 5 трат
	Объект.СписокРасходов.Загрузить(ПакетРезультатов[0].Выгрузить());
	
	// 2) Диаграмма категорий (круговая)
	ВыборкаКат = ПакетРезультатов[1].Выбрать();
	
	Если Объект.ДиаграммаКатегории.Серии.Количество() = 0 Тогда
		Объект.ДиаграммаКатегории.Серии.Добавить("Расходы");
	КонецЕсли;
	СерияКат = Объект.ДиаграммаКатегории.Серии[0];
	
	Пока ВыборкаКат.Следующий() Цикл
		ИмяТочки = ?(ЗначениеЗаполнено(ВыборкаКат.КатегорияГрафика), Строка(ВыборкаКат.КатегорияГрафика), "Без категории");
		Точка = Объект.ДиаграммаКатегории.Точки.Добавить(ИмяТочки);
		СуммаКат = ?(ВыборкаКат.Сумма < 0, -ВыборкаКат.Сумма, ВыборкаКат.Сумма);
Объект.ДиаграммаКатегории.УстановитьЗначение(Точка, СерияКат, СуммаКат);
	КонецЦикла;
	
	// 3) Диаграмма пользователей (гистограмма)
	ВыборкаПольз = ПакетРезультатов[2].Выбрать();
	
	Если Объект.ДиаграммаПользователи.Серии.Количество() = 0 Тогда
		Объект.ДиаграммаПользователи.Серии.Добавить("Траты");
	КонецЕсли;
	СерияПольз = Объект.ДиаграммаПользователи.Серии[0];
	
	Пока ВыборкаПольз.Следующий() Цикл
		Точка = Объект.ДиаграммаПользователи.Точки.Добавить(Строка(ВыборкаПольз.Пользователь));
		СуммаПольз = ?(ВыборкаПольз.Сумма < 0, -ВыборкаПольз.Сумма, ВыборкаПольз.Сумма);
Объект.ДиаграммаПользователи.УстановитьЗначение(Точка, СерияПольз, СуммаПольз);
	КонецЦикла;
	
	// 4) Остатки (надписи)
	ВыборкаОстатки = ПакетРезультатов[3].Выбрать();
	ОбщийОстаток = 0;
	
	Элементы.НадписьПавел.Заголовок = "Павел: 0 ₽";
	Элементы.НадписьЯна.Заголовок = "Яна: 0 ₽";
	
	Пока ВыборкаОстатки.Следующий() Цикл
		ИмяПольз = Строка(ВыборкаОстатки.Пользователь);
		СуммаТекст = Формат(ВыборкаОстатки.Остаток, "ЧДЦ=0; ЧГ=3") + " ₽";
		
		Если ИмяПольз = "Паша" Тогда
			Элементы.НадписьПавел.Заголовок = "Павел: " + СуммаТекст;
		ИначеЕсли ИмяПольз = "Яна" Тогда
			Элементы.НадписьЯна.Заголовок = "Яна: " + СуммаТекст;
		КонецЕсли;
		
		ОбщийОстаток = ОбщийОстаток + ВыборкаОстатки.Остаток;
	КонецЦикла;
	
	Элементы.НадписьОбщий.Заголовок = "Общий: " + Формат(ОбщийОстаток, "ЧДЦ=0; ЧГ=3") + " ₽";
	
КонецПроцедуры

&НаКлиенте
Процедура СортировкаПриИзменении(Элемент)
	ОбновитьДанныеНаСервере();
КонецПроцедуры
